Repository: makhlwf/App_Time_Blocker
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: ar

source: Show/Hide App
ar: AR: Show/Hide App

source: Exit Blocker
ar: AR: Exit Blocker

source: Idle. Configure and start monitoring.
ar: AR: Idle. Configure and start monitoring.

source: Configuration loaded from {config_path}
ar: AR: Configuration loaded from {config_path}

source: No prior configuration found. Using defaults.
ar: AR: No prior configuration found. Using defaults.

source: Admin check: ctypes.windll.shell32 not available. Assuming not admin.
ar: AR: Admin check: ctypes.windll.shell32 not available. Assuming not admin.

source: Error checking admin status: {error}
ar: AR: Error checking admin status: {error}

source: This application may not function correctly without Administrator privileges (e.g., terminating other admin-level apps). Would you like to try restarting it as Administrator?
ar: AR: This application may not function correctly without Administrator privileges (e.g., terminating other admin-level apps). AR: AR: Would you like to try restarting it as Administrator?

source: Administrator Privileges Recommended
ar: AR: Administrator Privileges Recommended

source: Failed to restart as admin: {error}
ar: AR: Failed to restart as admin: {error}

source: Error
ar: AR: Error

source: Admin restart failed: {error}
ar: AR: Admin restart failed: {error}

source: Application Settings
ar: AR: Application Settings

source: Application to Block:
ar: AR: Application to Block:

source: Browse...
ar: AR: Browse...

source: Block After (HH:MM):
ar: AR: Block After (HH:MM):

source: Controls
ar: AR: Controls

source: Start Monitoring
ar: AR: Start Monitoring

source: Stop Monitoring
ar: AR: Stop Monitoring

source: Status Log
ar: AR: Status Log

source: Stop monitoring before changing settings.
ar: AR: Stop monitoring before changing settings.

source: Warning
ar: AR: Warning

source: Executable files (*.exe)|*.exe|All files (*.*)|*.*
ar: AR: Executable files (*.exe)|*.exe|All files (*.*)|*.*

source: Select Application
ar: AR: Select Application

source: Selected application: {app_path}
ar: AR: Selected application: {app_path}

source: Configuration saved.
ar: AR: Configuration saved.

source: Monitoring stopped unexpectedly by the monitoring thread.
ar: AR: Monitoring stopped unexpectedly by the monitoring thread.

source: Please select an application to block.
ar: AR: Please select an application to block.

source: N/A
ar: AR: N/A

source: Monitoring started for {app_name}. Block after {hour:02d}:{minute:02d}.
ar: AR: Monitoring started for {app_name}. Block after {hour:02d}:{minute:02d}.

source: Stop monitoring signal sent...
ar: AR: Stop monitoring signal sent...

source: Monitoring is not active or already stopping.
ar: AR: Monitoring is not active or already stopping.

source: Exiting application...
ar: AR: Exiting application...

source: Waiting for monitor thread to finish...
ar: AR: Waiting for monitor thread to finish...

source: Monitor thread did not finish in time.
ar: AR: Monitor thread did not finish in time.

source: App Time Blocker v2
ar: AR: App Time Blocker v2

source: App Time Blocker Tray
ar: AR: App Time Blocker Tray
